onvif/GetProfiles.xml

<?xml version='1.0' encoding='utf-8'?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header>%s</s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><GetProfiles xmlns="http://www.onvif.org/ver10/media/wsdl"/></s:Body></s:Envelope>