nxvpro/Resources/soap_get_video_profile.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body xmlns:xsi="http://www.w3.aorg/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <GetProfile xmlns="http://www.onvif.org/ver10/media/wsdl">
            <ProfileToken>_PROFILE_</ProfileToken>
        </GetProfile>
    </s:Body>
</s:Envelope>
